## Все запросы выполняются в MySQL

### Module 1.1

#### Сформулируйте SQL запрос для создания таблицы book, занесите  его в окно кода (расположено ниже). Структура таблицы book:

In [ ]:
Create Table book (
    book_id INT PRIMARY KEY AUTO_INCREMENT,
    title Varchar(50),
    author Varchar(30),
    price Decimal(8, 2),
    amount Int
)

#### Занесите новую строку в таблицу book (текстовые значения (тип VARCHAR) заключать либо в двойные, либо в одинарные кавычки):

In [ ]:
INSERT INTO book (title, author, price, amount) 
VALUES ('Мастер и Маргарита', 'Булгаков М.А.', 670.99, 3);

#### Занесите три последние записи в таблицу book

In [ ]:
INSERT INTO book (title, author, price, amount) 
VALUES ('Белая гвардия', 'Булгаков М.А.', 540.50, 5);
INSERT INTO book (title, author, price, amount) 
VALUES ('Идиот', 'Достоевский Ф.М.', 460.00, 10);
INSERT INTO book (title, author, price, amount) 
VALUES ('Братья Карамазовы', 'Достоевский Ф.М.', 799.01, 2);
SELECT * FROM book;

### Module 1.2

#### Выбрать авторов, название книг и их цену из таблицы book.

In [ ]:
SELECT author, title, price 
FROM book;

#### Выбрать названия книг и авторов из таблицы book, для поля title задать новое имя Название, для поля author –  Автор.

In [ ]:
SELECT title AS Название, author as Автор
FROM book;

#### Для упаковки каждой книги требуется 1 лист бумаги, цена которого 1 рубль 65 копеек. Посчитать стоимость упаковки для каждой книги (сколько денег потребуется, чтобы упаковать все экземпляры книги). В запросе вывести название книги, ее количество и стоимость упаковки, последний столбец назвать pack.

In [ ]:
SELECT title, amount, 
    1.65 * amount AS pack
FROM book;

#### В конце года цену всех книг на складе пересчитывают – снижают ее на 30%. Написать SQL запрос, который из таблицы book выбирает названия, авторов, количества и вычисляет новые цены книг. Столбец с новой ценой назвать new_price, цену округлить до 2-х знаков после запятой.

In [ ]:
SELECT title, author, amount,
    ROUND(price-(price*0.3), 2) AS new_price 
FROM book

#### При анализе продаж книг выяснилось, что наибольшей популярностью пользуются книги Михаила Булгакова, на втором месте книги Сергея Есенина. Исходя из этого решили поднять цену книг Булгакова на 10%, а цену книг Есенина - на 5%. Написать запрос, куда включить автора, название книги и новую цену, последний столбец назвать new_price. Значение округлить до двух знаков после запятой.

In [ ]:
SELECT author, title,
    ROUND(IF(author = "Булгаков М.А.", price*1.1, IF(author = "Есенин С.А.", price*1.05, price)), 2) AS new_price
FROM book;

#### Вывести название, автора  и стоимость (цена умножить на количество) тех книг, стоимость которых больше 4000 рублей

In [ ]:
SELECT title, author, price * amount AS total
FROM book
WHERE price * amount > 4000;

#### Вывести автора, название  и цены тех книг, количество которых меньше 10.

In [ ]:
Select author, title, price From book where amount < 10;

#### Вывести название, цену  тех книг, которые написал Булгаков или Есенин, ценой больше 600 рублей

In [ ]:
SELECT title, author, price 
FROM book
WHERE (author = 'Булгаков М.А.' OR author = 'Есенин С.А.') AND price > 600;

#### Вывести название, автора,  цену  и количество всех книг, цена которых меньше 500 или больше 600, а стоимость всех экземпляров этих книг больше или равна 5000.

In [ ]:
Select title, author, price, amount
From book
where (price < 500 or price > 600) and price * amount >= 5000;

#### Выбрать названия и количества тех книг, количество которых от 5 до 14 включительно.
#### Запросы выводят одно и тоже

In [ ]:
SELECT title, amount 
FROM book
WHERE amount BETWEEN 5 AND 14;

In [ ]:
SELECT title, amount 
FROM book
WHERE amount >= 5 AND amount <=14;

#### Вывести название и авторов тех книг, цены которых принадлежат интервалу от 540.50 до 800 (включая границы),  а количество или 2, или 3, или 5, или 7 .

In [ ]:
Select title, author
From book
Where (price between 540.50 and 800) and amount in (2, 3, 5, 7);

#### Вывести названия книг, начинающихся с буквы «Б».

In [ ]:
SELECT title 
FROM book
WHERE title LIKE 'Б%';

#### Вывести название, автора и цены книг. Информацию  отсортировать по названиям книг в алфавитном порядке.

In [ ]:
SELECT title, author, price
FROM book
ORDER BY title;

#### Вывести автора, название и количество книг, в отсортированном в алфавитном порядке по автору и по убыванию количества, для тех книг, цены которых меньше 750 рублей.

In [ ]:
SELECT author, title, amount AS Количество
FROM book
WHERE price < 750
ORDER BY author, amount DESC;

#### Вывести  автора и название  книг, количество которых принадлежит интервалу от 2 до 14 (включая границы). Информацию  отсортировать по авторам (в обратном алфавитном порядке) и названиям (по алфавиту).

In [ ]:
Select author, title
From book
Where amount Between 2 and 14
Order By author Desc, title;

### Module 1.3

#### Чтобы отобрать уникальные элементы некоторого столбца используется ключевое слово DISTINCT, которое размещается сразу после SELECT.

In [ ]:
SELECT DISTINCT author
FROM book;

#### Можно сделать тоже самое с помощью GROUP BY

In [ ]:
SELECT  author
FROM book
GROUP BY author;

#### Отобрать различные элементы столбца amount таблицы book.

In [ ]:
Select amount
From book
Group By amount;

#### Посчитать, сколько экземпляров книг каждого автора хранится на складе.

In [ ]:
SELECT author, SUM(amount)
FROM book
GROUP BY author;

#### Посчитать, количество различных книг и количество экземпляров книг каждого автора , хранящихся на складе. Вычисляемые столбцы назвать Различных_книг и Количество_экземпляров соответственно, столбец с фамилиями авторов назвать Автор.

In [ ]:
SELECT author as 'Автор', Count(author) as 'Различных_книг', Sum(amount) as 'Количество_экземпляров'
FROM book
GROUP BY author;

#### Вывести минимальную, максимальную и среднюю цену книг каждого автора . Вычисляемые столбцы назвать Минимальная_цена, Максимальная_цена и Средняя_цена соответственно.

In [ ]:
SELECT author, Min(price) as 'Минимальная_цена', Max(price) as 'Максимальная_цена', Avg(price) as 'Средняя_цена'
FROM book
GROUP BY author;

#### Вывести суммарную стоимость книг каждого автора.

In [ ]:
SELECT author, SUM(price * amount) AS Стоимость
FROM book
GROUP BY author;

#### Вывести суммарную стоимость книг каждого автора.

In [ ]:
SELECT author, SUM(price * amount) AS Стоимость
FROM book
GROUP BY author;

#### Посчитать общее количество экземпляров книг на складе и их стоимость.

In [ ]:
SELECT SUM(amount) AS Количество, 
SUM(price * amount) AS Стоимость
FROM book;

#### Вывести  цену самой дешевой книги, цену самой дорогой и среднюю цену книг на складе. Названия столбцов Минимальная_цена, Максимальная_цена, Средняя_цена соответственно. Среднюю цену округлить до двух знаков после запятой.

In [ ]:
Select Min(price) as 'Минимальная_цена', Max(price) as 'Максимальная_цена', Round(Avg(price), 2) as 'Средняя_цена'
From book;

#### Найти минимальную и максимальную цену книг всех авторов, общая стоимость книг которых больше 5000.

In [ ]:
SELECT author,
MIN(price) AS Минимальная_цена, 
MAX(price) AS Максимальная_цена
FROM book
GROUP BY author
HAVING SUM(price * amount) > 5000;

#### Вычислить среднюю цену и суммарную стоимость тех книг, количество экземпляров которых принадлежит интервалу от 5 до 14, включительно. Столбцы переименовать как показано в образце, значения округлить до 2-х знаков после запятой.

In [ ]:
Select 
Round(Avg(price), 2) As 'Средняя_цена',
Round(Sum(price * amount), 2) As 'Стоимость'
From book
WHERE amount BETWEEN 5 AND 14;

### порядок выполнения  SQL запроса на выборку на сервере:

#### 1. FROM
#### 2. WHERE
#### 3. GROUP BY
#### 4. HAVING
#### 5. SELECT
#### 6. ORDER BY

#### Вывести максимальную и минимальную цену книг всех авторов, кроме Есенина, количество экземпляров книг которых больше 10.

In [ ]:
SELECT author,
MIN(price) AS Минимальная_цена,
MAX(price) AS Максимальная_цена
FROM book
WHERE author <> 'Есенин С.А.'
GROUP BY author
HAVING SUM(amount) > 10;

#### Посчитать стоимость всех экземпляров каждого автора без учета книг «Идиот» и «Белая гвардия». В результат включить только тех авторов, у которых суммарная стоимость книг более 5000 руб. Результат отсортировать по убыванию стоимости.

In [ ]:
Select author,
Sum(price * amount) As Стоимость
From book
Where title <> 'Идиот' and title <> 'Белая гвардия'
GROUP BY author
Having Sum(price * amount) > 5000
ORDER BY 2 DESC;